///*
//Напишите программу, которая на вход принимает число и выдаёт его квадрат 
// 4 -> 16
//-3 -> 9
//-7 -> 49
//*/


Console.WriteLine("Введите число: ");
int number = Convert.ToInt32(Console.ReadLine());
int rezalt = number * number;

Console.WriteLine (rezalt);